/*=====================================================================================
模块名  ：
文件名  ：string_eager.h
相关文件：
实现功能：实现string类，eager版本(特殊处理)
作者    ：包增辉(bao.z.h.2008@gmail.com)
版权    ：
---------------------------------------------------------------------------------------
修改记录：
日期        版本    修改人      走读人      修改记录
2014/1/4    V1.0    包增辉                    创建
========================================================================================*/




#include <iostream>
#include "string_eager.h"



//把这个函数的定义放在cpp文件中，.h文件只放声明
std::ostream& operator<<(std::ostream &out,const String &str)
{
    out << str.c_str();
    return out;
}



